#include<stdio.h>



//算数操作符

//int main()
//{
//	//int 是整型数据，任何整型数据之间的运算其结果都是整型，小数部分会丢弃
//	//int a = 3 / 5;//0.6
//	// 
//	//float是浮点数据，但6 / 5的结果本来就为1，放入变量a中为1.000000，没有任何变化
//	//float a = 6 / 5;
//
//	float a = 6.0 / 5.0;//只要运算语句中有一个浮点数据，那么结果就为浮点数据，保留小数位
//	printf("%f\n", a);
//	return 0;
//}

//int main()
//{
//	int a = 7 % 3;//取模（%）的两边值必须为整型数据
//	printf("%d", a);
//	return 0;
//}



//移位操作符

//int main()
//{
//	int a = 1, A = -1;
//	//移位操作符原理是把a的二进制位向左移动一位
//	int b = a << 1, B = A << 1;
//	//a:00000000000000000000000000000010
//	//a二进制位 -- 左边丢弃一位，右边补0
//	//b:00000000000000000000000000000100
//	int c = a >> 1, C = A >> 1;
//	//a二进制 -- 右边丢弃一位，左边补0
//	//c:00000000000000000000000000000001
//	printf("%d %d %d\n%d %d %d", a, b, c, A, B, C);
//	//由例子A = -2可知
//	//算术移动，只移动符号位以外的二进制位
//	return 0;
//}
////整数的二进制表示形式：3种
////原码：直接根据数值写出的二进制序列就是原码
////反码：原码的符号位不变，其他位按位取反就是反码
////补码：反码+1，就是补码 -- 存储在内存中
////例如：-1 >
////原码：10000000000000000000000000000001
////反码：11111111111111111111111111111110
////补码：11111111111111111111111111111111



//位操作符：& | ^ -- 三种操作符的变量对象类型必须为整型

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//& - 按（2进制）位与 -- 同1为1，异为0
//	//| - 按（2进制）位或 -- 有1为1，无1为0
//	//^ - 按（2进制）位异或 -- 同为0，异为1
//	int c = a & b;
//	int C = a | b;
//	int d = a ^ b;
//	printf("c = %d\n", c);
//	printf("C = %d\n", C);
//	printf("d = %d\n", d);
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000001 -- 按位与
//	//00000000000000000000000000000111 -- 按位或
//	//00000000000000000000000000000110 -- 按位异或
//}

//不添加第三个变量，交换两数的值
//int main()
//{
//	int a = 5, b = 3;
//
//	//第一种方法 -- 有一定的缺陷：数值太大会溢出（如果两数为负数）
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	
//	//第二种方法 -- 原理：a ^ b ^ b == a
//	a = a ^ b;
//	//a......101
//	//b......011
//	//a......110 -- 计算后
//	b = a ^ b;
//	//a......110
//	//b......011
//	//b......101 -- 计算后
//	a = a ^ b;
//	//a......110
//	//b......101
//	//a......011 -- 计算后
//	printf("a = %d b = %d", a, b);
//	return 0;
//}

//求一个整数存储在内存中的二进制1的个数
//int main()
//{
//	int a, b = 0;
//	scanf_s("%d", &a);
//	while (a)//当a的二进制位一直右移直到再无1进制数时，此时a为0，停止计数
//	{
//		if ((a & 1) == 1)//==的优先级比&高，所以要加括号，否则有警告
//			b++;
//		a = a >> 1;
//	}
//	printf("%d", b);
//	return 0;
//}



//赋值操作符

//= -- 赋值
//== -- 判断



//单目操作符 - 只有一个操作数

//！ - + & sizeof ~ ++ -- * (类型)

//int main()
//{
//	int a = 5;
//	printf("%d\n", !a);
//	if (a)//a为真
//	{
//		printf("true");
//	}
//	//a为假，打印false
//	if (!a)//a为假 -- a为0
//	{
//		printf("false");
//	}
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	a = -a;
//	printf("%d", a);
//	return 0;
//}

//int main()
//{
//	//int a = 10;
//	//char arr[10] = { 0 };
//	//printf("%d\n", sizeof(a));//计算a所占字节的大小，单位是字节
//	//printf("%d\n", sizeof(int));
//	//printf("%d\n", sizeof(a));
//	//printf("%d\n", sizeof(arr));
//	//sizeof是一个操作符，不是函数
//	short s = 5;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 2));//sizeof括号中的表达式不参与运算
//	printf("%d\n", s);
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码
//	//~ 按位取反
//	//11111111111111111111111111111111
//	//00000000000000000000000000000000 - 按位取反后
//	int b = ~a;
//	printf("%d\n%d", a, b);
//	return 0;
//}

int main()
{
	int a = 13;
	//把a的二进制中的第5位置成1
}