#include<stdio.h>



//算数操作符

//int main()
//{
//	//int 是整型数据，任何整型数据之间的运算其结果都是整型，小数部分会丢弃
//	//int a = 3 / 5;//0.6
//	// 
//	//float是浮点数据，但6 / 5的结果本来就为1，放入变量a中为1.000000，没有任何变化
//	//float a = 6 / 5;
//
//	float a = 6.0 / 5.0;//只要运算语句中有一个浮点数据，那么结果就为浮点数据，保留小数位
//	printf("%f\n", a);
//	return 0;
//}

//int main()
//{
//	int a = 7 % 3;//取模（%）的两边值必须为整型数据
//	printf("%d", a);
//	return 0;
//}



//移位操作符

//int main()
//{
//	int a = 1, A = -1;
//	//移位操作符原理是把a的二进制位向左移动一位
//	int b = a << 1, B = A << 1;
//	//a:00000000000000000000000000000010
//	//a二进制位 -- 左边丢弃一位，右边补0
//	//b:00000000000000000000000000000100
//	int c = a >> 1, C = A >> 1;
//	//a二进制 -- 右边丢弃一位，左边补0
//	//c:00000000000000000000000000000001
//	printf("%d %d %d\n%d %d %d", a, b, c, A, B, C);
//	//由例子A = -2可知
//	//算术移动，只移动符号位以外的二进制位
//	return 0;
//}
////整数的二进制表示形式：3种
////原码：直接根据数值写出的二进制序列就是原码
////反码：原码的符号位不变，其他位按位取反就是反码
////补码：反码+1，就是补码 -- 存储在内存中
////例如：-1 >
////原码：10000000000000000000000000000001
////反码：11111111111111111111111111111110
////补码：11111111111111111111111111111111



//位操作符：& | ^ -- 三种操作符的变量对象类型必须为整型

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//& - 按（2进制）位与 -- 同1为1，异为0
//	//| - 按（2进制）位或 -- 有1为1，无1为0
//	//^ - 按（2进制）位异或 -- 同为0，异为1
//	int c = a & b;
//	int C = a | b;
//	int d = a ^ b;
//	printf("c = %d\n", c);
//	printf("C = %d\n", C);
//	printf("d = %d\n", d);
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000001 -- 按位与
//	//00000000000000000000000000000111 -- 按位或
//	//00000000000000000000000000000110 -- 按位异或
//}

//不添加第三个变量，交换两数的值
//int main()
//{
//	int a = 5, b = 3;
//
//	//第一种方法 -- 有一定的缺陷：数值太大会溢出（如果两数为负数）
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	
//	//第二种方法 -- 原理：a ^ b ^ b == a
//	a = a ^ b;
//	//a......101
//	//b......011
//	//a......110 -- 计算后
//	b = a ^ b;
//	//a......110
//	//b......011
//	//b......101 -- 计算后
//	a = a ^ b;
//	//a......110
//	//b......101
//	//a......011 -- 计算后
//	printf("a = %d b = %d", a, b);
//	return 0;
//}

//求一个整数存储在内存中的二进制1的个数
//int main()
//{
//	int a, b = 0;
//	scanf_s("%d", &a);
//	while (a)//当a的二进制位一直右移直到再无1进制数时，此时a为0，停止计数
//	{
//		if ((a & 1) == 1)//==的优先级比&高，所以要加括号，否则有警告
//			b++;
//		a = a >> 1;
//	}
//	printf("%d", b);
//	return 0;
//}



//赋值操作符

//= -- 赋值
//== -- 判断



//单目操作符 - 只有一个操作数

//！ - + & sizeof ~ ++ -- * (类型)

//int main()
//{
//	int a = 5;
//	printf("%d\n", !a);
//	if (a)//a为真
//	{
//		printf("true");
//	}
//	//a为假，打印false
//	if (!a)//a为假 -- a为0
//	{
//		printf("false");
//	}
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	a = -a;
//	printf("%d", a);
//	return 0;
//}

//int main()
//{
//	//int a = 10;
//	//char arr[10] = { 0 };
//	//printf("%d\n", sizeof(a));//计算a所占字节的大小，单位是字节
//	//printf("%d\n", sizeof(int));
//	//printf("%d\n", sizeof(a));
//	//printf("%d\n", sizeof(arr));
//	//sizeof是一个操作符，不是函数
//	short s = 5;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 2));//sizeof括号中的表达式不参与运算
//	printf("%d\n", s);
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码
//	//~ 按位取反 -- 0按位取反后为1
//	//11111111111111111111111111111111
//	//00000000000000000000000000000000 - 按位取反后
//	int b = ~a;
//	printf("%d\n%d", a, b);
//	return 0;
//}

//int main()
//{
//	int a = 13;
//	//把a的二进制中的第5位置成1
//	a = a | (1 << 4);//按位或 - 有1为1，无1为0
//	printf("a = %d\n", a);
//	
//	//00000000000000000000000000001101
//	//00000000000000000000000000010000
//	//00000000000000000000000000011101
//	//1<<4
//	//00000000000000000000000000000001
//	
//	//把a的二进制中的第5位置成0
//	a = a & ~(1 << 4);//按位与 - 同1为1，异为0
//	printf("a = %d\n", a);
//	//00000000000000000000000000011101
//	//11111111111111111111111111101111
//	//00000000000000000000000000010000
//	//00000000000000000000000000001101
//}

//int main()
//{
//	int a = 10;
//	//int b = ++a;//前置++ -> 先++，再使用
//	//int b = a++;//后置++ -> 先使用，再++
//	//int b = --a;//前置-- -> 先--，再使用
//	int b = a--;//后置-- -> 先使用，再--
//	printf("%d\n", a--);//9
//	printf("%d\n", a);//11 | 11 | 9 | 9 | a-- -> 8
//	printf("%d\n", b);//11 | 10 | 9 | 10 | 10
//}

//int main()
//{
//	int a = 0;
//	printf("%p\n", &a);//& - 取地址操作符
//	int* pa = &a;//pa是用来存放地址的 - pa就是一个指针变量
//	*pa = 20;//* - 解引用操作符 - 间接访问操作符
//	return 0;
//}

//int main()
//{
//	int a = (int)3.14;
//	printf("%d", a);
//	return 0;
//}

//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));//(2) -- 指针变量的字节空间大小都是4/8，32位系统是4位，64位系统是8字节
//}
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));//(4)
//}
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//(1)
//	printf("%d\n", sizeof(ch));//(3)
//	test1(arr);
//	test2(ch);
//	return 0;
//}



//关系操作符

//> < >= <= != ==

//int main()
//{
//	int a = 5, b = 3;
//	if (a > b)
//	{
//		printf("%d", a);
//	}
//	return 0;
//}
// = 赋值 == 判断相等 != 判断不相等
//比较两个字符串 不能使用 == 要使用strcmp



//逻辑操作符

//&& ||

//int main()
//{
//	int a = 3;
//	int b = 0;
//	//&& -- 逻辑与
//	if (a && b)//意为判断两个数字都为真 -- 当两个数字都不为0时，为真
//	{
//		printf("hehe");
//	}
//	//|| -- 逻辑或
//	if (a || b)//意为判断两个数字是否都为假 -- 当两个数字都为0时，为假
//	{
//		printf("haha");
//	}
//	return 0;
//}

//int main()
//{
//	int i = 0, a = 1, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;//&& - 逻辑与的短路定理 - 当逻辑与中的表达式出现假时，后面的表达式就不再执行
//	i = a++ || ++b || d++;//|| - 逻辑或的短路定理 - 当逻辑或中的表达式出现真时，后面的表达式就不再执行
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
//	return 0;
//}



//条件操作符

////（表达式）?（表达式）:（表达式）
//int main()
//{
//	int a = 3, b = 0;
//	if (a > 5)
//		b = 1;
//	else
//		b = -1;
//	//三目操作符
//	b = (a > 5) ? 1 : -1;//如果a > 5为真，执行?后面的语句，如果为假，执行:后面的语句
//	return 0;
//}



//逗号表达式

//int main()
//{
//	int a = 3, b = 5, c = 0;
//	//逗号表达式 - 要从左向右依次计算，但是整个表达式的结果是最后一个表达式的结果
//	int d = (c = 5, a = c + 3, b = a - 4, c += 5);
//	//       c = 10 a = 8      b = 4
//	printf("%d\n", d);
//	return 0;
//}



//下标引用操作符

//int main()
//{
//	int a[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//	//下标        0  1  2  3  4
//	printf("%d\n", a[4]);//[] - 下标引用操作符
//	//3 + 5
//	return 0;
//}



//函数调用操作符

//int add(int a, int b)
//{
//	return a + b;
//}
//void test()
//{}
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int ret = add(a, b);//() - 函数调用操作符
//	test();
//	printf("%d", ret);
//	return 0;
//}



//结构体成员访问操作符
//.
//->

//struct Book
//{
//	//结构体的成员变量
//	char name[20];
//	char id[20];
//	int price;
//};
//int main()
//{
//	int num = 10;
//	struct Book b = { "C语言", "C2022", 55 };
//	struct Book *pb = &b;
//	printf("书名：%s\nID：%s\n定价：%d", b.name, b.id, b.price);
//	printf("书名：%s\nID：%s\n定价：%d", (*pb).name, (*pb).id, (*pb).price);
//	printf("书名：%s\nID：%s\n定价：%d", pb->name, pb->id, pb->price);//pb是一种指针，指向结构体的成员 -- 结构体指针->成员名
//	return 0;
//}



//表达式求值

//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a + b * 7;
//}



//整型提升

//int main()
//{
//	char a = 3;
//	//00000000000000000000000000000011
//	//00000011 - a
//	char b = 127;
//	//01111111 - b
//	char c = a + b;
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111
//	//
//	//00000000000000000000000010000010
//	//10000010 - c
//	//11111111111111111111111110000010 -- 补码
//	//11111111111111111111111110000001 -- 反码
//	//10000000000000000000000001111110 00 原码
//	//a和b都是char类型的，都没有达到一个int的大小
//	//于是这里就会发生整型提升
//	printf("%d\n", c);
//	return 0;
//}
//当变量自身的数据类型大小达不到整型类型数据大小，参与运算就会整型提升
//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//	printf("%u\n", sizeof(+c));//4
//	printf("%u\n", sizeof(-c));//4
//	printf("%u\n", sizeof(!c));//4 -- gcc - 4
//	return 0;
//}

//运算符的优先级决定计算顺序
//int c = a + b * 7
//当优先级不起作用，结合性决定顺序
//int c = a + b + 7
//

//特殊情况 -- 是一个有问题，有歧义的问题表达式
//int main()
//{
//	int c = 2;
//	printf("%d\n", c + --c);
//	return 0;
//}

//问题代码
//int fun()
//{
//	static int conut = 1;
//	return ++conut;
//}
//int main()
//{
//	int answer;
//	answer = fun() - fun() * fun();//2 - 3 * 4
//	//无法确定上述三个fun函数哪一个先执行，顺序不同，结果也不同
//	printf("%d\n", answer);
//	return 0;
//}
//int main()
//{
//	int i = 1;
//	int ret = (++i) + (++i) + (++i);//VS计算顺序是先计算++i，所有计算完再计算(++i)+(++i) 
//	printf("%d\n", ret);
//	return 0;
//}



//逗号表达式的特殊使用
//int main()
//{
//	int a[] = { 1, 2, (3, 4), 5 };//a[] = { 1, 2, 4, 5 };
//	printf("%d\n", sizeof(a));
//	return 0;
//}

int main()
{
	char str[] = "hello bit";
	printf("%d %d\n", sizeof(str), strlen(str));//sizeof包含字符串中的\0，strlen不包含字符串中的\0
	//strlen - 函数 - 求字符串长度，找\0之前出现的字符个数
	//sizeof - 操作数 - 计算变量/类型所占内存大小，单位是字节
	return 0;
}